// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]


int [] array = { 1, 2, 5, 7, 19 };
var a = string.Join("," , array);
Console.WriteLine($"Массив --> [{a}]");

int [] array1 = { 6, 1, 33};
var b = string.Join("," , array1);
Console.WriteLine($"Массив --> [{b}]");


